rotten_potatoes/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("potatoes", "movie_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["potatoes", 1], ["movie_id", 4], ["user_id", 1], ["created_at", "2018-04-10 16:30:31.431961"], ["updated_at", "2018-04-10 16:30:31.431961"]]
---
  def create
    # since moviegoer_id is a protected attribute that won't get
    # assigned by the mass-assignment from params[:review], we set it
    # by using the << method on the association.  We could also
    # set it manually with review.moviegoer = @current_user.
    @current_user.reviews << @movie.reviews.build(review_params)