rotten_potatoes/app/views/movies/show.html.haml


- if @movie.reviews.any?
---
SELECT  1 AS one FROM "reviews" WHERE "reviews"."movie_id" = ? LIMIT ?  [["movie_id", 3], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 4]]